add github workflows for logfindr
